import pdfplumber
import pandas as pd
import xlwt
import time

"""  学科  """

edu_key = [
    {"id": "202201", "name": "基础形态"},
    {"id": "202202", "name": "基础机能"},
    {"id": "202203", "name": "临床内科学"},
    {"id": "202204", "name": "临床外科学"},
    {"id": "202205", "name": "妇产科学"},
    {"id": "202206", "name": "儿科学"},
    {"id": "202207", "name": "眼、耳鼻咽喉科学"},
    {"id": "202208", "name": "口腔医学"},
    {"id": "202209", "name": "影像医学"},
    {"id": "202210", "name": "急诊学"},
    {"id": "202211", "name": "医学检验"},
    {"id": "202212", "name": "公共卫生与预防医学"},
    {"id": "202213", "name": "药学"},
    {"id": "202214", "name": "护理学"},
    {"id": "202215", "name": "医学教育与卫生管理学"},
    {"id": "202216", "name": "康复医学"},
    {"id": "202217", "name": "全科医学"},
    {"id": "202218", "name": "麻醉学"},
    {"id": "202219", "name": "重症医学"},
    {"id": "202220", "name": "皮肤病学与性病学"},
    {"id": "202221", "name": "核医学"},
    {"id": "202222", "name": "医院感染（管理）学"},
    {"id": "202223", "name": "心理学"},
    {"id": "202224", "name": "卫生法规与医学伦理学"},
    {"id": "20220101", "name": "组织胚胎学", "parent": "202201"},
    {"id": "20220102", "name": "解剖学", "parent": "202201"},
    {"id": "20220103", "name": "遗传学", "parent": "202201"},
    {"id": "20220104", "name": "病理学", "parent": "202201"},
    {"id": "20220105", "name": "寄生虫学", "parent": "202201"},
    {"id": "20220106", "name": "微生物学", "parent": "202201"},
    {"id": "20220201", "name": "生理学", "parent": "202202"},
    {"id": "20220202", "name": "生物化学", "parent": "202202"},
    {"id": "20220203", "name": "生物物理学", "parent": "202202"},
    {"id": "20220204", "name": "药理学", "parent": "202202"},
    {"id": "20220205", "name": "细胞生物学", "parent": "202202"},
    {"id": "20220206", "name": "病生理学", "parent": "202202"},
    {"id": "20220207", "name": "免疫学", "parent": "202202"},
    {"id": "20220208", "name": "基础医学其他学科", "parent": "202202"},
    {"id": "20220301", "name": "心血管病学", "parent": "202203"},
    {"id": "20220302", "name": "呼吸病学", "parent": "202203"},
    {"id": "20220303", "name": "消化病学", "parent": "202203"},
    {"id": "20220304", "name": "血液病学", "parent": "202203"},
    {"id": "20220305", "name": "肾脏病学", "parent": "202203"},
    {"id": "20220306", "name": "内分泌学", "parent": "202203"},
    {"id": "20220307", "name": "神经内科学", "parent": "202203"},
    {"id": "20220308", "name": "感染病学", "parent": "202203"},
    {"id": "20220309", "name": "精神卫生学", "parent": "202203"},
    {"id": "20220310", "name": "老年医学", "parent": "202203"},
    {"id": "20220311", "name": "内科学其他学科", "parent": "202203"},
    {"id": "20220401", "name": "普通外科学", "parent": "202204"},
    {"id": "20220402", "name": "心胸外科学", "parent": "202204"},
    {"id": "20220403", "name": "烧伤外科学", "parent": "202204"},
    {"id": "20220404", "name": "神经外科学", "parent": "202204"},
    {"id": "20220405", "name": "泌尿外科学", "parent": "202204"},
    {"id": "20220406", "name": "显微外科学", "parent": "202204"},
    {"id": "20220407", "name": "骨外科学", "parent": "202204"},
    {"id": "20220408", "name": "肿瘤外科学", "parent": "202204"},
    {"id": "20220409", "name": "颅脑外科学", "parent": "202204"},
    {"id": "20220410", "name": "整形、器官移植外科学", "parent": "202204"},
    {"id": "20220411", "name": "外科学其他学科", "parent": "202204"},
    {"id": "20220501", "name": "妇科学", "parent": "202205"},
    {"id": "20220502", "name": "产科学", "parent": "202205"},
    {"id": "20220503", "name": "妇产科学其他学科", "parent": "202205"},
    {"id": "20220601", "name": "儿科内科学", "parent": "202206"},
    {"id": "20220602", "name": "儿科外科学", "parent": "202206"},
    {"id": "20220603", "name": "新生儿科学", "parent": "202206"},
    {"id": "20220604", "name": "儿科学其他学科", "parent": "202206"},
    {"id": "20220701", "name": "耳鼻咽喉科学", "parent": "202207"},
    {"id": "20220702", "name": "眼科学", "parent": "202207"},
    {"id": "20220801", "name": "口腔内科学", "parent": "202208"},
    {"id": "20220802", "name": "口腔外科学", "parent": "202208"},
    {"id": "20220803", "name": "口腔正畸学", "parent": "202208"},
    {"id": "20220804", "name": "口腔修复学", "parent": "202208"},
    {"id": "20220805", "name": "口腔学其他学科", "parent": "202208"},
    {"id": "20220901", "name": "放射诊断学", "parent": "202209"},
    {"id": "20220902", "name": "超声诊断学", "parent": "202209"},
    {"id": "20220903", "name": "放射肿瘤学", "parent": "202209"},
    {"id": "20220904", "name": "影像医学其他学科", "parent": "202209"},
    {"id": "20221001", "name": "急诊学", "parent": "202210"},
    {"id": "20221101", "name": "医学检验", "parent": "202211"},
    {"id": "20221201", "name": "劳动卫生与环境卫生学", "parent": "202212"},
    {"id": "20221202", "name": "营养与食品卫生学", "parent": "202212"},
    {"id": "20221203", "name": "儿少卫生与妇幼卫生学", "parent": "202212"},
    {"id": "20221204", "name": "卫生毒理学", "parent": "202212"},
    {"id": "20221205", "name": "统计流行病学", "parent": "202212"},
    {"id": "20221206", "name": "卫生检验学", "parent": "202212"},
    {"id": "20221207", "name": "公共卫生与预防医学其他学科", "parent": "202212"},
    {"id": "20221301", "name": "临床药学和临床药理学", "parent": "202213"},
    {"id": "20221302", "name": "药剂学", "parent": "202213"},
    {"id": "20221303", "name": "药物分析学", "parent": "202213"},
    {"id": "20221304", "name": "药事管理学", "parent": "202213"},
    {"id": "20221305", "name": "药学其他学科", "parent": "202213"},
    {"id": "20221401", "name": "内科护理学", "parent": "202214"},
    {"id": "20221402", "name": "外科护理学", "parent": "202214"},
    {"id": "20221403", "name": "妇产科护理学", "parent": "202214"},
    {"id": "20221404", "name": "儿科护理学", "parent": "202214"},
    {"id": "20221405", "name": "护理其他学科", "parent": "202214"},
    {"id": "20221501", "name": "医学教育", "parent": "202215"},
    {"id": "20221502", "name": "卫生管理", "parent": "202215"},
    {"id": "20221601", "name": "康复医学", "parent": "202216"},
    {"id": "20221701", "name": "全科医学", "parent": "202217"},
    {"id": "20221801", "name": "麻醉学", "parent": "202218"},
    {"id": "20221901", "name": "重症医学", "parent": "202219"},
    {"id": "20222001", "name": "皮肤病学与性病学", "parent": "202220"},
    {"id": "20222101", "name": "核医学", "parent": "202221"},
    {"id": "20222201", "name": "医院感染（管理）学", "parent": "202222"},
    {"id": "20222301", "name": "医学心理学", "parent": "202223"},
    {"id": "20222302", "name": "临床与咨询心理学", "parent": "202223"},
    {"id": "20222303", "name": "心理学其他学科", "parent": "202223"},
    {"id": "20222401", "name": "医学人文与医德医风", "parent": "202224"},
    {"id": "20222402", "name": "医患沟通", "parent": "202224"},
    {"id": "20222403", "name": "科研伦理", "parent": "202224"},
    {"id": "20222404", "name": "卫生法规", "parent": "202224"}
]

metadata = {
    'id': [],
    'name': [],
    'parent': []
}

for i in edu_key:
    metadata['id'].append(i['id'])
    metadata['name'].append(i['name'])

    if i.get('parent'):
        metadata['parent'].append(i['parent'])
    else:
        metadata['parent'].append('')


def to_excel(metadata):
    file_name = '学科标题%s.xlsx' % (time.strftime('%Y-%m-%d'))

    confirm_execl_data = {
        'id': metadata['id'],
        'name': metadata['name'],
        'parent': metadata['parent']

    }

    writer = pd.ExcelWriter(file_name)

    df_confirm = pd.DataFrame(confirm_execl_data)
    df_confirm.to_excel(excel_writer=writer, sheet_name='学科标题')

    writer.save()
    writer.close()


to_excel(metadata=metadata)
