import pdfplumber
import pandas as pd
import xlwt
import time

"""  学科  """

edu_key = [
    {"id": "202301", "name": "基础形态"},
    {"id": "202302", "name": "基础机能"},
    {"id": "202303", "name": "临床内科学"},
    {"id": "202304", "name": "临床外科学"},
    {"id": "202305", "name": "妇产科学"},
    {"id": "202306", "name": "儿科学"},
    {"id": "202307", "name": "眼、耳鼻咽喉科学"},
    {"id": "202308", "name": "口腔医学"},
    {"id": "202309", "name": "影像医学"},
    {"id": "202310", "name": "急诊学"},
    {"id": "202311", "name": "医学检验"},
    {"id": "202312", "name": "公共卫生与预防医学"},
    {"id": "202313", "name": "药学"},
    {"id": "202314", "name": "护理学"},
    {"id": "202315", "name": "医学教育与卫生管理学"},
    {"id": "202316", "name": "康复医学"},
    {"id": "202317", "name": "全科医学"},
    {"id": "202318", "name": "麻醉学"},
    {"id": "202319", "name": "重症医学"},
    {"id": "202320", "name": "皮肤病学与性病学"},
    {"id": "202321", "name": "核医学"},
    {"id": "202322", "name": "医院感染（管理）学"},
    {"id": "202323", "name": "心理学"},
    {"id": "202324", "name": "卫生法规与医学伦理学"},
    {"id": "20230101", "name": "组织胚胎学", "parent": "202301"},
    {"id": "20230102", "name": "解剖学", "parent": "202301"},
    {"id": "20230103", "name": "遗传学", "parent": "202301"},
    {"id": "20230104", "name": "病理学", "parent": "202301"},
    {"id": "20230105", "name": "寄生虫学", "parent": "202301"},
    {"id": "20230106", "name": "微生物学", "parent": "202301"},
    {"id": "20230201", "name": "生理学", "parent": "202302"},
    {"id": "20230202", "name": "生物化学", "parent": "202302"},
    {"id": "20230203", "name": "生物物理学", "parent": "202302"},
    {"id": "20230204", "name": "药理学", "parent": "202302"},
    {"id": "20230205", "name": "细胞生物学", "parent": "202302"},
    {"id": "20230206", "name": "病生理学", "parent": "202302"},
    {"id": "20230207", "name": "免疫学", "parent": "202302"},
    {"id": "20230208", "name": "基础医学其他学科", "parent": "202302"},
    {"id": "20230301", "name": "心血管病学", "parent": "202303"},
    {"id": "20230302", "name": "呼吸病学", "parent": "202303"},
    {"id": "20230303", "name": "消化病学", "parent": "202303"},
    {"id": "20230304", "name": "血液病学", "parent": "202303"},
    {"id": "20230305", "name": "肾脏病学", "parent": "202303"},
    {"id": "20230306", "name": "内分泌学", "parent": "202303"},
    {"id": "20230307", "name": "神经内科学", "parent": "202303"},
    {"id": "20230308", "name": "感染病学", "parent": "202303"},
    {"id": "20230309", "name": "精神卫生学", "parent": "202303"},
    {"id": "20230310", "name": "老年医学", "parent": "202303"},
    {"id": "20230311", "name": "内科学其他学科", "parent": "202303"},
    {"id": "20230401", "name": "普通外科学", "parent": "202304"},
    {"id": "20230402", "name": "心胸外科学 ", "parent": "202304"},
    {"id": "20230403", "name": "烧伤外科学", "parent": "202304"},
    {"id": "20230404", "name": "神经外科学", "parent": "202304"},
    {"id": "20230405", "name": "泌尿外科学", "parent": "202304"},
    {"id": "20230406", "name": "显微外科学", "parent": "202304"},
    {"id": "20230407", "name": "骨外科学", "parent": "202304"},
    {"id": "20230408", "name": "肿瘤外科学", "parent": "202304"},
    {"id": "20230409", "name": "颅脑外科学", "parent": "202304"},
    {"id": "20230410", "name": "整形、器官移植外科学", "parent": "202304"},
    {"id": "20230411", "name": "外科学其他学科", "parent": "202304"},
    {"id": "20230501", "name": "妇科学", "parent": "202305"},
    {"id": "20230502", "name": "产科学", "parent": "202305"},
    {"id": "20230503", "name": "妇产科学其他学科", "parent": "202305"},
    {"id": "20230601", "name": "儿科内科学", "parent": "202306"},
    {"id": "20230602", "name": "儿科外科学", "parent": "202306"},
    {"id": "20230603", "name": "新生儿科学", "parent": "202306"},
    {"id": "20230604", "name": "儿科学其他学科", "parent": "202306"},
    {"id": "20230701", "name": "耳鼻咽喉科学", "parent": "202307"},
    {"id": "20230702", "name": "眼科学", "parent": "202307"},
    {"id": "20230801", "name": "口腔内科学", "parent": "202308"},
    {"id": "20230802", "name": "口腔外科学", "parent": "202308"},
    {"id": "20230803", "name": "口腔正畸学", "parent": "202308"},
    {"id": "20230804", "name": "口腔修复学", "parent": "202308"},
    {"id": "20230805", "name": "口腔学其他学科", "parent": "202308"},
    {"id": "20230901", "name": "放射诊断学", "parent": "202309"},
    {"id": "20230902", "name": "超声诊断学", "parent": "202309"},
    {"id": "20230903", "name": "放射肿瘤学", "parent": "202309"},
    {"id": "20230904", "name": "影像医学其他学科", "parent": "202309"},
    {"id": "20231001", "name": "急诊学", "parent": "202310"},
    {"id": "20231101", "name": "医学检验", "parent": "202311"},
    {"id": "20231201", "name": "劳动卫生与环境卫生学", "parent": "202312"},
    {"id": "20231202", "name": "营养与食品卫生学", "parent": "202312"},
    {"id": "20231203", "name": "儿少卫生与妇幼卫生学", "parent": "202312"},
    {"id": "20231204", "name": "卫生毒理学", "parent": "202312"},
    {"id": "20231205", "name": "统计流行病学", "parent": "202312"},
    {"id": "20231206", "name": "卫生检验学", "parent": "202312"},
    {"id": "20231207", "name": "公共卫生与预防医学其他学科", "parent": "202312"},
    {"id": "20231301", "name": "临床药学和临床药理学", "parent": "202313"},
    {"id": "20231302", "name": "药剂学", "parent": "202313"},
    {"id": "20231303", "name": "药物分析学", "parent": "202313"},
    {"id": "20231304", "name": "药事管理学", "parent": "202313"},
    {"id": "20231305", "name": "药学其他学科", "parent": "202313"},
    {"id": "20231401", "name": "内科护理学", "parent": "202314"},
    {"id": "20231402", "name": "外科护理学", "parent": "202314"},
    {"id": "20231403", "name": "妇产科护理学", "parent": "202314"},
    {"id": "20231404", "name": "儿科护理学", "parent": "202314"},
    {"id": "20231405", "name": "护理其他学科", "parent": "202314"},
    {"id": "20231501", "name": "医学教育", "parent": "202315"},
    {"id": "20231502", "name": "卫生管理", "parent": "202315"},
    {"id": "20231601", "name": "康复医学", "parent": "202316"},
    {"id": "20231701", "name": "全科医学", "parent": "202317"},
    {"id": "20231801", "name": "麻醉学", "parent": "202318"},
    {"id": "20231901", "name": "重症医学", "parent": "202319"},
    {"id": "20232001", "name": "皮肤病学与性病学", "parent": "202320"},
    {"id": "20232101", "name": "核医学", "parent": "202321"},
    {"id": "20232201", "name": "医院感染（管理）学", "parent": "202322"},
    {"id": "20232301", "name": "医学心理学", "parent": "202323"},
    {"id": "20232302", "name": "临床与咨询心理学", "parent": "202323"},
    {"id": "20232303", "name": "心理学其他学科", "parent": "202323"},
    {"id": "20232401", "name": "医学人文与医德医风", "parent": "202324"},
    {"id": "20232402", "name": "医患沟通", "parent": "202324"},
    {"id": "20232403", "name": "科研伦理", "parent": "202324"},
    {"id": "20232404", "name": "卫生法规", "parent": "202324"},
]

metadata = {
    'id': [],
    'name': [],
    'parent': []
}

for i in edu_key:
    metadata['id'].append(i['id'])
    metadata['name'].append(i['name'])

    if i.get('parent'):
        metadata['parent'].append(i['parent'])
    else:
        metadata['parent'].append('')


def to_excel(metadata):
    file_name = '学科标题%s.xlsx' % (time.strftime('%Y-%m-%d'))

    confirm_execl_data = {
        'id': metadata['id'],
        'name': metadata['name'],
        'parent': metadata['parent']

    }

    writer = pd.ExcelWriter(file_name)

    df_confirm = pd.DataFrame(confirm_execl_data)
    df_confirm.to_excel(excel_writer=writer, sheet_name='学科标题')

    # writer.save()
    # FutureWarning: save is not part of the public API, usage can give unexpected results and will be removed in a future version
    # 在新的版本中 save 方法已私有化 直接调用close 即可

    writer.close()


to_excel(metadata=metadata)
