import pandas as pd
import time

"""  学科数据治理  """

edu_key_2024 = [
    {"id": "202401", "name": "基础形态"},
    {"id": "202402", "name": "基础机能"},
    {"id": "202403", "name": "临床内科学"},
    {"id": "202404", "name": "临床外科学"},
    {"id": "202405", "name": "妇产科学"},
    {"id": "202406", "name": "儿科学"},
    {"id": "202407", "name": "眼、耳鼻咽喉科学"},
    {"id": "202408", "name": "口腔医学"},
    {"id": "202409", "name": "影像医学"},
    {"id": "202410", "name": "急诊学"},
    {"id": "202411", "name": "医学检验"},
    {"id": "202412", "name": "公共卫生与预防医学"},
    {"id": "202413", "name": "药学"},
    {"id": "202414", "name": "护理学"},
    {"id": "202415", "name": "医学教育与卫生管理学"},
    {"id": "202416", "name": "康复医学"},
    {"id": "202417", "name": "全科医学"},
    {"id": "202418", "name": "麻醉学"},
    {"id": "202419", "name": "重症医学"},
    {"id": "202420", "name": "皮肤病学与性病学"},
    {"id": "202421", "name": "核医学"},
    {"id": "202422", "name": "医院感染（管理）学"},
    {"id": "202423", "name": "心理学"},
    {"id": "202424", "name": "卫生法规与医学伦理学"},
    {"id": "20240101", "name": "组织胚胎学", "parent": "202401"},
    {"id": "20240102", "name": "解剖学", "parent": "202401"},
    {"id": "20240103", "name": "遗传学", "parent": "202401"},
    {"id": "20240104", "name": "病理学", "parent": "202401"},
    {"id": "20240105", "name": "寄生虫学", "parent": "202401"},
    {"id": "20240106", "name": "微生物学", "parent": "202401"},
    {"id": "20240201", "name": "生理学", "parent": "202402"},
    {"id": "20240202", "name": "生物化学", "parent": "202402"},
    {"id": "20240203", "name": "生物物理学", "parent": "202402"},
    {"id": "20240204", "name": "药理学", "parent": "202402"},
    {"id": "20240205", "name": "细胞生物学", "parent": "202402"},
    {"id": "20240206", "name": "病生理学", "parent": "202402"},
    {"id": "20240207", "name": "免疫学", "parent": "202402"},
    {"id": "20240208", "name": "基础医学其他学科", "parent": "202402"},
    {"id": "20240301", "name": "心血管病学", "parent": "202403"},
    {"id": "20240302", "name": "呼吸病学", "parent": "202403"},
    {"id": "20240303", "name": "消化病学", "parent": "202403"},
    {"id": "20240304", "name": "血液病学", "parent": "202403"},
    {"id": "20240305", "name": "肾脏病学", "parent": "202403"},
    {"id": "20240306", "name": "内分泌学", "parent": "202403"},
    {"id": "20240307", "name": "神经内科学", "parent": "202403"},
    {"id": "20240308", "name": "感染病学", "parent": "202403"},
    {"id": "20240309", "name": "精神卫生学", "parent": "202403"},
    {"id": "20240310", "name": "老年医学", "parent": "202403"},
    {"id": "20240311", "name": "内科学其他学科", "parent": "202403"},
    {"id": "20240401", "name": "普通外科学", "parent": "202404"},
    {"id": "20240402", "name": "心胸外科学 ", "parent": "202404"},
    {"id": "20240403", "name": "烧伤外科学", "parent": "202404"},
    {"id": "20240404", "name": "神经外科学", "parent": "202404"},
    {"id": "20240405", "name": "泌尿外科学", "parent": "202404"},
    {"id": "20240406", "name": "显微外科学", "parent": "202404"},
    {"id": "20240407", "name": "骨外科学", "parent": "202404"},
    {"id": "20240408", "name": "肿瘤外科学", "parent": "202404"},
    {"id": "20240409", "name": "颅脑外科学", "parent": "202404"},
    {"id": "20240410", "name": "整形、器官移植外科学", "parent": "202404"},
    {"id": "20240411", "name": "外科学其他学科", "parent": "202404"},
    {"id": "20240501", "name": "妇科学", "parent": "202405"},
    {"id": "20240502", "name": "产科学", "parent": "202405"},
    {"id": "20240503", "name": "妇产科学其他学科", "parent": "202405"},
    {"id": "20240601", "name": "儿科内科学", "parent": "202406"},
    {"id": "20240602", "name": "儿科外科学", "parent": "202406"},
    {"id": "20240603", "name": "新生儿科学", "parent": "202406"},
    {"id": "20240604", "name": "儿科学其他学科", "parent": "202406"},
    {"id": "20240701", "name": "耳鼻咽喉科学", "parent": "202407"},
    {"id": "20240702", "name": "眼科学", "parent": "202407"},
    {"id": "20240801", "name": "口腔内科学", "parent": "202408"},
    {"id": "20240802", "name": "口腔外科学", "parent": "202408"},
    {"id": "20240803", "name": "口腔正畸学", "parent": "202408"},
    {"id": "20240804", "name": "口腔修复学", "parent": "202408"},
    {"id": "20240805", "name": "口腔学其他学科", "parent": "202408"},
    {"id": "20240901", "name": "放射诊断学", "parent": "202409"},
    {"id": "20240902", "name": "超声诊断学", "parent": "202409"},
    {"id": "20240903", "name": "放射肿瘤学", "parent": "202409"},
    {"id": "20240904", "name": "影像医学其他学科", "parent": "202409"},
    {"id": "20241001", "name": "急诊学", "parent": "202410"},
    {"id": "20241101", "name": "医学检验", "parent": "202411"},
    {"id": "20241201", "name": "劳动卫生与环境卫生学", "parent": "202412"},
    {"id": "20241202", "name": "营养与食品卫生学", "parent": "202412"},
    {"id": "20241203", "name": "儿少卫生与妇幼卫生学", "parent": "202412"},
    {"id": "20241204", "name": "卫生毒理学", "parent": "202412"},
    {"id": "20241205", "name": "统计流行病学", "parent": "202412"},
    {"id": "20241206", "name": "卫生检验学", "parent": "202412"},
    {"id": "20241207", "name": "公共卫生与预防医学其他学科", "parent": "202412"},
    {"id": "20241301", "name": "临床药学和临床药理学", "parent": "202413"},
    {"id": "20241302", "name": "药剂学", "parent": "202413"},
    {"id": "20241303", "name": "药物分析学", "parent": "202413"},
    {"id": "20241304", "name": "药事管理学", "parent": "202413"},
    {"id": "20241305", "name": "药学其他学科", "parent": "202413"},
    {"id": "20241401", "name": "内科护理学", "parent": "202414"},
    {"id": "20241402", "name": "外科护理学", "parent": "202414"},
    {"id": "20241403", "name": "妇产科护理学", "parent": "202414"},
    {"id": "20241404", "name": "儿科护理学", "parent": "202414"},
    {"id": "20241405", "name": "护理其他学科", "parent": "202414"},
    {"id": "20241501", "name": "医学教育", "parent": "202415"},
    {"id": "20241502", "name": "卫生管理", "parent": "202415"},
    {"id": "20241601", "name": "康复医学", "parent": "202416"},
    {"id": "20241701", "name": "全科医学", "parent": "202417"},
    {"id": "20241801", "name": "麻醉学", "parent": "202418"},
    {"id": "20241901", "name": "重症医学", "parent": "202419"},
    {"id": "20242001", "name": "皮肤病学与性病学", "parent": "202420"},
    {"id": "20242101", "name": "核医学", "parent": "202421"},
    {"id": "20242201", "name": "医院感染（管理）学", "parent": "202422"},
    {"id": "20242301", "name": "医学心理学", "parent": "202423"},
    {"id": "20242302", "name": "临床与咨询心理学", "parent": "202423"},
    {"id": "20242303", "name": "心理学其他学科", "parent": "202423"},
    {"id": "20242401", "name": "医学人文与医德医风", "parent": "202424"},
    {"id": "20242402", "name": "医患沟通", "parent": "202424"},
    {"id": "20242403", "name": "科研伦理", "parent": "202424"},
    {"id": "20242404", "name": "卫生法规", "parent": "202424"},
]

edu_key = [
    {"id": "202501", "name": "基础形态"},
    {"id": "202502", "name": "基础机能"},
    {"id": "202503", "name": "临床内科学"},
    {"id": "202504", "name": "临床外科学"},
    {"id": "202505", "name": "妇产科学"},
    {"id": "202506", "name": "儿科学"},
    {"id": "202507", "name": "眼、耳鼻咽喉科学"},
    {"id": "202508", "name": "口腔医学"},
    {"id": "202509", "name": "影像医学"},
    {"id": "202510", "name": "急诊学"},
    {"id": "202511", "name": "医学检验"},
    {"id": "202512", "name": "公共卫生与预防医学"},
    {"id": "202513", "name": "药学"},
    {"id": "202514", "name": "护理学"},
    {"id": "202515", "name": "医学教育与卫生管理学"},
    {"id": "202516", "name": "康复医学"},
    {"id": "202517", "name": "全科医学"},
    {"id": "202518", "name": "麻醉学"},
    {"id": "202519", "name": "重症医学"},
    {"id": "202520", "name": "皮肤病学与性病学"},
    {"id": "202521", "name": "核医学"},
    {"id": "202522", "name": "医院感染（管理）学"},
    {"id": "202523", "name": "心理学"},
    {"id": "202524", "name": "卫生法规与医学伦理学"},
    {"id": "20250101", "name": "组织胚胎学", "parent": "202501"},
    {"id": "20250102", "name": "解剖学", "parent": "202501"},
    {"id": "20250103", "name": "遗传学", "parent": "202501"},
    {"id": "20250104", "name": "病理学", "parent": "202501"},
    {"id": "20250105", "name": "寄生虫学", "parent": "202501"},
    {"id": "20250106", "name": "微生物学", "parent": "202501"},
    {"id": "20250201", "name": "生理学", "parent": "202502"},
    {"id": "20250202", "name": "生物化学", "parent": "202502"},
    {"id": "20250203", "name": "生物物理学", "parent": "202502"},
    {"id": "20250204", "name": "药理学", "parent": "202502"},
    {"id": "20250205", "name": "细胞生物学", "parent": "202502"},
    {"id": "20250206", "name": "病生理学", "parent": "202502"},
    {"id": "20250207", "name": "免疫学", "parent": "202502"},
    {"id": "20250208", "name": "基础医学其他学科", "parent": "202502"},
    {"id": "20250301", "name": "心血管病学", "parent": "202503"},
    {"id": "20250302", "name": "呼吸病学", "parent": "202503"},
    {"id": "20250303", "name": "消化病学", "parent": "202503"},
    {"id": "20250304", "name": "血液病学", "parent": "202503"},
    {"id": "20250305", "name": "肾脏病学", "parent": "202503"},
    {"id": "20250306", "name": "内分泌学", "parent": "202503"},
    {"id": "20250307", "name": "神经内科学", "parent": "202503"},
    {"id": "20250308", "name": "感染病学", "parent": "202503"},
    {"id": "20250309", "name": "精神卫生学", "parent": "202503"},
    {"id": "20250310", "name": "老年医学", "parent": "202503"},
    {"id": "20250311", "name": "内科学其他学科", "parent": "202503"},
    {"id": "20250401", "name": "普通外科学", "parent": "202504"},
    {"id": "20250402", "name": "心胸外科学", "parent": "202504"},
    {"id": "20250403", "name": "烧伤外科学", "parent": "202504"},
    {"id": "20250404", "name": "神经外科学", "parent": "202504"},
    {"id": "20250405", "name": "泌尿外科学", "parent": "202504"},
    {"id": "20250406", "name": "显微外科学", "parent": "202504"},
    {"id": "20250407", "name": "骨外科学", "parent": "202504"},
    {"id": "20250408", "name": "肿瘤外科学", "parent": "202504"},
    {"id": "20250409", "name": "颅脑外科学", "parent": "202504"},
    {"id": "20250410", "name": "整形、器官移植外科学", "parent": "202504"},
    {"id": "20250411", "name": "外科学其他学科", "parent": "202504"},
    {"id": "20250501", "name": "妇科学", "parent": "202505"},
    {"id": "20250502", "name": "产科学", "parent": "202505"},
    {"id": "20250503", "name": "妇产科学其他学科", "parent": "202505"},
    {"id": "20250601", "name": "儿科内科学", "parent": "202506"},
    {"id": "20250602", "name": "儿科外科学", "parent": "202506"},
    {"id": "20250603", "name": "新生儿科学", "parent": "202506"},
    {"id": "20250604", "name": "儿科学其他学科", "parent": "202506"},
    {"id": "20250701", "name": "耳鼻咽喉科学", "parent": "202507"},
    {"id": "20250702", "name": "眼科学", "parent": "202507"},
    {"id": "20250801", "name": "口腔内科学", "parent": "202508"},
    {"id": "20250802", "name": "口腔外科学", "parent": "202508"},
    {"id": "20250803", "name": "口腔正畸学", "parent": "202508"},
    {"id": "20250804", "name": "口腔修复学", "parent": "202508"},
    {"id": "20250805", "name": "口腔学其他学科", "parent": "202508"},
    {"id": "20250901", "name": "放射诊断学", "parent": "202509"},
    {"id": "20250902", "name": "超声诊断学", "parent": "202509"},
    {"id": "20250903", "name": "放射肿瘤学", "parent": "202509"},
    {"id": "20250904", "name": "影像医学其他学科", "parent": "202509"},
    {"id": "20251001", "name": "急诊学", "parent": "202510"},
    {"id": "20251101", "name": "医学检验", "parent": "202511"},
    {"id": "20251201", "name": "劳动卫生与环境卫生学", "parent": "202512"},
    {"id": "20251202", "name": "营养与食品卫生学", "parent": "202512"},
    {"id": "20251203", "name": "儿少卫生与妇幼卫生学", "parent": "202512"},
    {"id": "20251204", "name": "卫生毒理学", "parent": "202512"},
    {"id": "20251205", "name": "统计流行病学", "parent": "202512"},
    {"id": "20251206", "name": "卫生检验学", "parent": "202512"},
    {"id": "20251207", "name": "公共卫生与预防医学其他学科", "parent": "202512"},
    {"id": "20251301", "name": "临床药学和临床药理学", "parent": "202513"},
    {"id": "20251302", "name": "药剂学", "parent": "202513"},
    {"id": "20251303", "name": "药物分析学", "parent": "202513"},
    {"id": "20251304", "name": "药事管理学", "parent": "202513"},
    {"id": "20251305", "name": "药学其他学科", "parent": "202513"},
    {"id": "20251401", "name": "内科护理学", "parent": "202514"},
    {"id": "20251402", "name": "外科护理学", "parent": "202514"},
    {"id": "20251403", "name": "妇产科护理学", "parent": "202514"},
    {"id": "20251404", "name": "儿科护理学", "parent": "202514"},
    {"id": "20251405", "name": "护理其他学科", "parent": "202514"},
    {"id": "20251501", "name": "医学教育", "parent": "202515"},
    {"id": "20251502", "name": "卫生管理", "parent": "202515"},
    {"id": "20251601", "name": "康复医学", "parent": "202516"},
    {"id": "20251701", "name": "全科医学", "parent": "202517"},
    {"id": "20251801", "name": "麻醉学", "parent": "202518"},
    {"id": "20251901", "name": "重症医学", "parent": "202519"},
    {"id": "20252001", "name": "皮肤病学与性病学", "parent": "202520"},
    {"id": "20252101", "name": "核医学", "parent": "202521"},
    {"id": "20252201", "name": "医院感染（管理）学", "parent": "202522"},
    {"id": "20252301", "name": "医学心理学", "parent": "202523"},
    {"id": "20252302", "name": "临床与咨询心理学", "parent": "202523"},
    {"id": "20252303", "name": "心理学其他学科", "parent": "202523"},
    {"id": "20252401", "name": "医学人文与医德医风", "parent": "202524"},
    {"id": "20252402", "name": "医患沟通", "parent": "202524"},
    {"id": "20252403", "name": "科研伦理", "parent": "202524"},
    {"id": "20252404", "name": "卫生法规", "parent": "202524"}
]
metadata = {
    'id': [],
    'name': [],
    'parent': []
}

for i in edu_key:
    metadata['id'].append(i['id'])
    metadata['name'].append(i['name'])

    if i.get('parent'):
        metadata['parent'].append(i['parent'])
    else:
        metadata['parent'].append('')


def to_excel(metadata):
    file_name = '学科标题_%s.xlsx' % (time.strftime('%Y-%m-%d'))

    confirm_execl_data = {
        'id': metadata['id'],
        'name': metadata['name'],
        'parent': metadata['parent']

    }

    writer = pd.ExcelWriter(file_name)

    df_confirm = pd.DataFrame(confirm_execl_data)
    df_confirm.to_excel(excel_writer=writer, sheet_name='学科标题')

    # writer.save()
    # FutureWarning: save is not part of the public API, usage can give unexpected results and will be removed in a future version
    # 在新的版本中 save 方法已私有化 直接调用close 即可

    writer.close()


to_excel(metadata=metadata)

"学科标题转SQL"


def to_inster_sql(excel_file=None, sql_file_name=None, *args, **kwargs):
    if excel_file is None:
        excel_file = '学科标题_%s.xlsx' % (time.strftime('%Y-%m-%d'))

    if sql_file_name is None:
        sql_file_name = '学科标题_INSERT_%s.sql' % (time.strftime('%Y-%m-%d'))

    df = pd.read_excel(excel_file)
    now_rows = df.shape[0]  # 获取行数
    df.fillna("null", inplace=True)  # 将空字符给赋指定默认值NULL

    with open(sql_file_name, mode='a', encoding='utf-8') as f:
        sql = "insert into edu_record_key (id, h_name, parent_id) values"
        f.write(sql)

        for i in range(now_rows):
            # 去除索引列
            data = list(df.loc[i].values)
            data.pop(0)

            data = str(tuple(data)) + ','
            # print(data)

            f.write(data)

    return sql_file_name


to_inster_sql()
