import re

# re.findall 匹配所有字符
"""
    \w  匹配字母数字及下划线
    \W  匹配非字母数字及下划线
    \s  匹配任意空白字符 等价于 [\t \n \r \f]
    \S  匹配任意空白字符
    \d  匹配任意数字 等价于 [0-9]
    \D  匹配任意非数字
    
    ^  匹配字符串开头
    $  匹配字符串末尾
"""
print(re.findall('\d', 'abc123_*()-='))  # ['1', '2', '3']

# 重复匹配：| . | * | ? | .* | .*? | + | {n,m} |
"""
    .  匹配除了 \n 之外任意一个字符  指定 re.DOTALL 之后才能匹配换行符
    *  左侧字符重复0次或无穷次 性格贪婪
    +  左侧字符重复1次或无穷次 性格贪婪
    ?  左侧字符重复0次或1次 性格贪婪
    {n,m}  左侧字符重复n次到m次 性格贪婪
    .* 
"""
print(re.findall('a.b', 'a\nb acdb acb', re.DOTALL))  # ['a\nb', 'acb']

# 匹配所有包含小数在内的数字
print(re.findall('\d+\.?\d*', "asdfasdf123as1.13dfa12adsf1asdf3"))  # ['123', '1.13', '12', '1', '3']


"""
    []  匹配指定字符 []内^ 代表取反
    ()  匹配
"""
print(re.findall('a[0-9]b','a1b a*b a-b a=b'))  # ['a1b']