import requests
import re
import pandas as pd
import time

metadata = {
    'project_num': ['2022-01-02-\n007 (国)', '2022-01-02-\n008 (国)', '2022-01-02-\n009 (国)', '2022-01-02-\n010 (国)',
                    '2022-01-03-\n020 (国)', '2022-01-03-\n021 (国)', '2022-01-03-\n022 (国)', '2022-01-03-\n029 (国)',
                    '2022-01-04-\n110 (国)', '2022-01-04-\n111 (国)', '2022-01-04-\n112 (国)', '2022-01-04-\n113 (国)',
                    '2022-01-04-\n114 (国)', '2022-01-04-\n115 (国)', '2022-01-04-\n116 (国)', '2022-01-04-\n117 (国)',
                    '2022-01-04-\n118 (国)', '2022-01-04-\n119 (国)', '2022-01-04-\n120 (国)'],
    'project_name': ['显微神经外科解剖训练\n班', '《神经解剖学》师资培\n训班', '第十七届护理解剖学学\n术年会', '第28届全国断层影像解\n剖学及其临床应用学习\n班',
                     '出生缺陷与遗传咨询学\n习班', '中国临床分子诊断大会', '双胎妊娠产前风险评估\n与临床干预技术培训班', '临床遗传咨询能力专项\n培训', '全国头颈部病理读片研\n讨会',
                     '消化系统病理诊断研讨\n会', '神经病理新进展学习班\n及疑难病例MDT讨论会', '肺癌病理：从冰冻诊断\n到分子检测新进展', '肝脏疾病临床病理新进\n展',
                     '消化系统疾病病理诊断\n与新进展学习班', '软组织肿瘤病理诊断与\n新进展', '骨关节肿瘤和瘤样病变\n的病理诊断', '淋巴组织增生性病变病\n理诊断及新进展',
                     '甲状腺肿瘤和瘤样病变\n的病理诊断', '淋巴瘤病理诊断新进展'],
    'company': ['四川省医学科学院.四川\n省人民医院', '中国解剖学会神经解剖\n学分会', '中国解剖学会', '中国解剖学会', '上海市遗传学会', '四川省医学科学院四\n川省人民医院',
                '云南省第一人民医院', '国家卫生健康委能力建\n设和继续教育中心', '首都医科大学附属北京\n同仁医院', '首都医科大学附属北京\n友谊医院', '首都医科大学三博脑科\n医院',
                '上海市胸科医院', '复旦大学附属华山医院', '复旦大学附属肿瘤医院', '复旦大学附属肿瘤医院', '上海市第六人民医院', '上海交通大学医学院附\n属瑞金医院', '上海市第六人民医院',
                '复旦大学附属肿瘤医院'],
    'leading_name': ['陈立华', '李辉', '丁自海', '刘树伟', '卢大儒', '杨正林', '朱姝', '贺林', '刘红刚', '陈光勇', '齐雪岭', '韩昱晨', '唐峰', '盛伟琪', '王坚',
                     '张惠箴', '王朝夫', '刘志艳', '李小秋'],
    'tel': ['15828358\n882', '029-\n84712260', '13535126\n369', '0531-\n88382171', '021-\n51630619', '13981880\n412',
            '0871-\n63638248', '010-\n83041838', '010-\n58268685', '010-\n63138557', '13167382\n259', '18017327\n736',
            '021-\n52888168', '021-\n64175590', '021-\n64175590', '021-\n24058759', '17321086\n332', '021-\n24058759',
            '021-\n64175590'],
    'startdate': ['2022/10/31', '2022/08/12', '2022/07/23', '2022/07/23', '2022/04/09', '2022/04/02', '2022/09/16',
                  '2022/05/09', '2022/06/17', '2022/06/18', '2022/04/08', '2022/05/20', '2022/05/19', '2022/06/18',
                  '2022/05/19', '2022/08/23', '2022/10/14', '2022/10/12', '2022/04/10'],
    'enddate': ['2022/11/02', '2022/08/20', '2022/07/25', '2022/07/26', '2022/04/13', '2022/04/03', '2022/09/18',
                '2022/05/15', '2022/06/19', '2022/06/19', '2022/04/10', '2022/05/24', '2022/05/23', '2022/06/22',
                '2022/05/23', '2022/08/29', '2022/10/18', '2022/10/17', '2022/04/14'],
    'date_num': ['3.0天', '9.0天', '3.0天', '4.0天', '5.0天', '2.0天', '3.0天', '6.5天/期', '3.0天', '2.0天', '3.0天', '5.0天',
                 '5.0天', '5.0天', '5.0天', '6.5天', '5.0天', '5.5天', '5.0天'],
    'address': ['四川成都市', '内蒙古包头市', '甘肃张掖市', '河北石家庄市', '浙江杭州市', '山东济南市', '云南昆明市', '陕西西安市', '北京', '北京', '北京', '上海', '上海',
                '上海', '上海', '上海', '上海', '上海', '上海'],
    'credit': ['6分', '10分', '6分', '8分', '10分', '4分', '6分', '10分/期', '6分', '4分', '6分', '10分', '10分', '10分', '10分', '10分',
               '10分', '10分', '10分'],
    'crowd': ['相关专业的继\n续教育对象', '相关专业的继\n续教育对象', '相关专业的继\n续教育对象', '解剖学、医学\n影像学等学科\n教师、医师及\n研究生等', '相关专业的继\n续教育对象',
              '相关专业的继\n续教育对象', '相关专业的继\n续教育对象', '临床医生、医\n学院或生命科\n学院毕业生、\n遗传咨询相关\n行业从业者', '相关专业的继\n续教育对象',
              '相关专业的继\n续教育对象', '病理诊断医师\n及技术人员、\n神经外科医师\n护士、医学影\n像医师及技术\n人员', '相关专业的继\n续教育对象', '相关专业的继\n续教育对象',
              '相关专业的继\n续教育对象', '相关专业的继\n续教育对象', '相关专业的继\n续教育对象', '相关专业的继\n续教育对象', '相关专业的继\n续教育对象', '相关专业的继\n续教育对象'],
    'person_num': ['24', '60', '180', '100', '300', '300', '200', '300/期', '100', '150', '100', '80', '30', '300',
                   '400', '40', '200', '40', '300'],
    'remark': ['备案', '备案', '备案', '备案', '备案', '备案', '备案',
               '备案\n2022/05/09-\n2022/05/15(\n陕西西安市)\n2022/07/11-\n2022/07/17(\n上海)\n2022/09/12-\n2022/09/18(\n北京)\n2022/11/21-\n2022/11/27(\n湖北武汉市)',
               '备案', '备案', '备案', '备案', '备案', '备案', '备案', '备案', '备案',
               '备案', '备案']}


def to_excel(metadata):
    file_name = '%s.xlsx' % (time.strftime('%Y-%m-%d'))

    confirm_execl_data = {
        'project_num': metadata['project_num'],
        'project_name': metadata['project_name'],
        'company': metadata['project_name'],
        'leading_name': metadata['leading_name'],
        'tel': metadata['tel'],
        'startdate': metadata['startdate'],
        'enddate': metadata['enddate'],
        'date_num': metadata['date_num'],
        'address': metadata['address'],
        'credit': metadata['credit'],
        'crowd': metadata['crowd'],
        'person_num': metadata['person_num'],
        'remark': metadata['remark']

    }

    writer = pd.ExcelWriter(file_name)

    df_confirm = pd.DataFrame(confirm_execl_data)
    df_confirm.to_excel(excel_writer=writer, sheet_name='继续教育')

    writer.save()
    writer.close()

to_excel(metadata=metadata)