from concurrent.futures import ProcessPoolExecutor
import time, os

# 创建进程池
"""池子造出来之后 里面会固定存在X个进程  这X个进程不会出现重复创建和销毁的过程 """
pool = ProcessPoolExecutor(5)  # 括号内可以不传数字,不传的话默认会开设当前计算机CPU个数进程


def task(n):
    print(n, os.getpid())
    time.sleep(2)
    return n


def call_back(n):
    print(f'异步提交返回结果:{n.result()}')


if __name__ == '__main__':
    for i in range(20):
        res = pool.submit(task, i).add_done_callback(call_back)

"""
0 17709
1 17707
2 17711
3 17708
4 17710
5 17707
异步提交返回结果:1
6 17709
7 17711
异步提交返回结果:2
异步提交返回结果:0
8 17708
异步提交返回结果:3
9 17710
异步提交返回结果:4
10 17707
11 17709
12 17711
异步提交返回结果:5
异步提交返回结果:6
异步提交返回结果:7
13 17708
异步提交返回结果:8
14 17710
异步提交返回结果:9
16 17709
15 17707
异步提交返回结果:10
17 17711
异步提交返回结果:11
异步提交返回结果:12
18 17708
异步提交返回结果:13
19 17710
异步提交返回结果:14
异步提交返回结果:15
异步提交返回结果:16
异步提交返回结果:17
异步提交返回结果:18
异步提交返回结果:19
"""
